dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.tdongle
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Recommended alongside bb_health stack
# monitor. See CONFIG_BB_TASK_REGISTRY_BASE_POLL_MS in bb_task_registry Kconfig.
# S3 does NOT define SOC_ASSIST_DEBUG_SUPPORTED in ESP-IDF 5.5.4 (confirmed
# empirically: components/soc/esp32s3/include/soc/soc_caps.h has no such
# define, and the merged sdkconfig.h shows CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# absent), unlike C3/C6/H2/P4 -- so the end-of-stack hardware watchpoint
# below is the best deterministic (not sampled-at-context-switch) detection
# this chip offers here, same as original ESP32.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# T-Dongle-S3 has 8 MB octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# Enable bb_log panic coredump capture
CONFIG_BB_DIAG_PANIC_COREDUMP=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
CONFIG_BB_DISPLAY_ST77XX_VARIANT_ST7735=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Enable uxTaskGetSystemState (used by bb_task_registry's periodic base-scan
# and GET /api/diag/tasks) so per-task stack high-water-mark reporting is
# non-stub in smoke builds. See bb_task_registry Kconfig and
# platform/espidf/bb_task_registry/bb_task_registry_base_scan.c. Smoke-only:
# examples/floor deliberately stays minimal (B1-1296).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# B1-1275: disable WPA2/WPA3-Enterprise WiFi -- the enterprise (802.1X/EAP)
# connection path is unused (no esp_wifi_sta_enterprise_*/esp_eap_client_*
# call sites); this shrinks compiled-in attack surface, not flash --
# linker --gc-sections was already stripping most of the dead code, so the
# measured delta is negligible either way (esp32 +168B, esp32c3 -722B).
# TLS, the mbedTLS cert bundle, and WPA3-Personal/SAE
# (CONFIG_ESP_WIFI_ENABLE_WPA3_SAE) are untouched.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

# B1-1482: same pin as sdkconfig.defaults.esp32 -- this board also only ever
# composes 2 genuinely-blocking clients (SSE+WS, examples/smoke/main/
# bb_wire.h), so pin the blocking-client budget to that real usage rather
# than letting it silently track the new CONFIG_BB_DATA_HTTP_MAX_CLIENTS
# default of 3 (which would trip bb_data_http_espidf.c's compile-time
# guard: 3*20=60ms >= the 50ms default sweep interval).
CONFIG_BB_DATA_HTTP_MAX_BLOCKING_CLIENTS=2
